{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform", 
        "src_layout": "NCHW", 
        "dst_layout": "NCHW3c", 
        "hash": "3c998d2e2320a54f"
      }, 
      "inputs": [
        [
          0, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p0", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p1", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW3i4o", 
        "data_layout": "NCHW3c", 
        "hash": "140996690986ee6a"
      }, 
      "inputs": [
        [
          1, 
          0, 
          0
        ], 
        [
          2, 
          0, 
          0
        ], 
        [
          3, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p2", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p3", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_depthwise_conv2d_NCHWc_add_nn_relu", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_depthwise_conv2d_NCHWc_add_nn_relu", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW1i4o", 
        "data_layout": "NCHW4c", 
        "hash": "35f443e6024b7cf7"
      }, 
      "inputs": [
        [
          4, 
          0, 
          0
        ], 
        [
          5, 
          0, 
          0
        ], 
        [
          6, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p4", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p5", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_1", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "hash": "9d01930507ba1ede"
      }, 
      "inputs": [
        [
          7, 
          0, 
          0
        ], 
        [
          8, 
          0, 
          0
        ], 
        [
          9, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p6", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p7", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_depthwise_conv2d_NCHWc_add_nn_relu_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_depthwise_conv2d_NCHWc_add_nn_relu_1", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW1i4o", 
        "data_layout": "NCHW4c", 
        "hash": "3c39895c5b8436c7"
      }, 
      "inputs": [
        [
          10, 
          0, 
          0
        ], 
        [
          11, 
          0, 
          0
        ], 
        [
          12, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p8", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p9", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_2", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "hash": "10d07b8f88a0a1d3"
      }, 
      "inputs": [
        [
          13, 
          0, 
          0
        ], 
        [
          14, 
          0, 
          0
        ], 
        [
          15, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p10", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p11", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_depthwise_conv2d_NCHWc_add_nn_relu_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_depthwise_conv2d_NCHWc_add_nn_relu_2", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW1i4o", 
        "data_layout": "NCHW4c", 
        "hash": "2a10d1ddec82bf25"
      }, 
      "inputs": [
        [
          16, 
          0, 
          0
        ], 
        [
          17, 
          0, 
          0
        ], 
        [
          18, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p12", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p13", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_3", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "hash": "6816d2597425a2c7"
      }, 
      "inputs": [
        [
          19, 
          0, 
          0
        ], 
        [
          20, 
          0, 
          0
        ], 
        [
          21, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p14", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p15", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_depthwise_conv2d_NCHWc_add_nn_relu_3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_depthwise_conv2d_NCHWc_add_nn_relu_3", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW1i4o", 
        "data_layout": "NCHW4c", 
        "hash": "f9141d8763e2719d"
      }, 
      "inputs": [
        [
          22, 
          0, 
          0
        ], 
        [
          23, 
          0, 
          0
        ], 
        [
          24, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p16", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p17", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_4", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_4", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "hash": "a7b8fdcb5e8e6820"
      }, 
      "inputs": [
        [
          25, 
          0, 
          0
        ], 
        [
          26, 
          0, 
          0
        ], 
        [
          27, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p18", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p19", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_depthwise_conv2d_NCHWc_add_nn_relu_4", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_depthwise_conv2d_NCHWc_add_nn_relu_4", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW1i4o", 
        "data_layout": "NCHW4c", 
        "hash": "e7d11a6de10cf6f4"
      }, 
      "inputs": [
        [
          28, 
          0, 
          0
        ], 
        [
          29, 
          0, 
          0
        ], 
        [
          30, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p20", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p21", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_5", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_5", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "hash": "377e0b95e31bfbda"
      }, 
      "inputs": [
        [
          31, 
          0, 
          0
        ], 
        [
          32, 
          0, 
          0
        ], 
        [
          33, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p22", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p23", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_depthwise_conv2d_NCHWc_add_nn_relu_5", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_depthwise_conv2d_NCHWc_add_nn_relu_5", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW1i4o", 
        "data_layout": "NCHW4c", 
        "hash": "7a88eacbab35bc81"
      }, 
      "inputs": [
        [
          34, 
          0, 
          0
        ], 
        [
          35, 
          0, 
          0
        ], 
        [
          36, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p24", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p25", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_6", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_6", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "hash": "4daaa5cf41f2e2e9"
      }, 
      "inputs": [
        [
          37, 
          0, 
          0
        ], 
        [
          38, 
          0, 
          0
        ], 
        [
          39, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p26", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p27", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_depthwise_conv2d_NCHWc_add_nn_relu_6", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_depthwise_conv2d_NCHWc_add_nn_relu_6", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW1i4o", 
        "data_layout": "NCHW4c", 
        "hash": "d24fc7698c43c224"
      }, 
      "inputs": [
        [
          40, 
          0, 
          0
        ], 
        [
          41, 
          0, 
          0
        ], 
        [
          42, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p28", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p29", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_7", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_7", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "hash": "9192bd5237c1bb38"
      }, 
      "inputs": [
        [
          43, 
          0, 
          0
        ], 
        [
          44, 
          0, 
          0
        ], 
        [
          45, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p30", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p31", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_depthwise_conv2d_NCHWc_add_nn_relu_61", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_depthwise_conv2d_NCHWc_add_nn_relu_6", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW1i4o", 
        "data_layout": "NCHW4c", 
        "hash": "d24fc7698c43c224"
      }, 
      "inputs": [
        [
          46, 
          0, 
          0
        ], 
        [
          47, 
          0, 
          0
        ], 
        [
          48, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p32", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p33", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_71", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_7", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "hash": "9192bd5237c1bb38"
      }, 
      "inputs": [
        [
          49, 
          0, 
          0
        ], 
        [
          50, 
          0, 
          0
        ], 
        [
          51, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p34", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p35", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_depthwise_conv2d_NCHWc_add_nn_relu_62", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_depthwise_conv2d_NCHWc_add_nn_relu_6", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW1i4o", 
        "data_layout": "NCHW4c", 
        "hash": "d24fc7698c43c224"
      }, 
      "inputs": [
        [
          52, 
          0, 
          0
        ], 
        [
          53, 
          0, 
          0
        ], 
        [
          54, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p36", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p37", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_72", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_7", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "hash": "9192bd5237c1bb38"
      }, 
      "inputs": [
        [
          55, 
          0, 
          0
        ], 
        [
          56, 
          0, 
          0
        ], 
        [
          57, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p38", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p39", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_depthwise_conv2d_NCHWc_add_nn_relu_63", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_depthwise_conv2d_NCHWc_add_nn_relu_6", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW1i4o", 
        "data_layout": "NCHW4c", 
        "hash": "d24fc7698c43c224"
      }, 
      "inputs": [
        [
          58, 
          0, 
          0
        ], 
        [
          59, 
          0, 
          0
        ], 
        [
          60, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p40", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p41", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_73", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_7", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "hash": "9192bd5237c1bb38"
      }, 
      "inputs": [
        [
          61, 
          0, 
          0
        ], 
        [
          62, 
          0, 
          0
        ], 
        [
          63, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p42", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p43", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_depthwise_conv2d_NCHWc_add_nn_relu_64", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_depthwise_conv2d_NCHWc_add_nn_relu_6", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW1i4o", 
        "data_layout": "NCHW4c", 
        "hash": "d24fc7698c43c224"
      }, 
      "inputs": [
        [
          64, 
          0, 
          0
        ], 
        [
          65, 
          0, 
          0
        ], 
        [
          66, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p44", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p45", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_74", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_7", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "hash": "9192bd5237c1bb38"
      }, 
      "inputs": [
        [
          67, 
          0, 
          0
        ], 
        [
          68, 
          0, 
          0
        ], 
        [
          69, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p46", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p47", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_depthwise_conv2d_NCHWc_add_nn_relu_7", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_depthwise_conv2d_NCHWc_add_nn_relu_7", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW1i4o", 
        "data_layout": "NCHW4c", 
        "hash": "2d8befcb63a97396"
      }, 
      "inputs": [
        [
          70, 
          0, 
          0
        ], 
        [
          71, 
          0, 
          0
        ], 
        [
          72, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p48", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p49", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_8", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_8", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "hash": "a583a6a5885c432e"
      }, 
      "inputs": [
        [
          73, 
          0, 
          0
        ], 
        [
          74, 
          0, 
          0
        ], 
        [
          75, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p50", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p51", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_depthwise_conv2d_NCHWc_add_nn_relu_8", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_depthwise_conv2d_NCHWc_add_nn_relu_8", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW1i4o", 
        "data_layout": "NCHW4c", 
        "hash": "ba7303e0de16eed1"
      }, 
      "inputs": [
        [
          76, 
          0, 
          0
        ], 
        [
          77, 
          0, 
          0
        ], 
        [
          78, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p52", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p53", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_9", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_9", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "hash": "3ffb9191d669979e"
      }, 
      "inputs": [
        [
          79, 
          0, 
          0
        ], 
        [
          80, 
          0, 
          0
        ], 
        [
          81, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_global_avg_pool2d", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_global_avg_pool2d", 
        "out_layout": "", 
        "layout": "NCHW4c", 
        "hash": "7bf0ff765b7919ef"
      }, 
      "inputs": [
        [
          82, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_nn_batch_flatten_nn_batch_flatten", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_nn_batch_flatten_nn_batch_flatten", 
        "src_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "e560efa18f100a92"
      }, 
      "inputs": [
        [
          83, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p54", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p55", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_dense_pack_add", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_dense_pack_add", 
        "weight_layout": "NC8n", 
        "hash": "60f4e400ac1f3b75"
      }, 
      "inputs": [
        [
          84, 
          0, 
          0
        ], 
        [
          85, 
          0, 
          0
        ], 
        [
          86, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_softmax", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_softmax", 
        "hash": "ca61e79ea24e53f0"
      }, 
      "inputs": [
        [
          87, 
          0, 
          0
        ]
      ]
    }
  ], 
  "arg_nodes": [
    0, 
    2, 
    3, 
    5, 
    6, 
    8, 
    9, 
    11, 
    12, 
    14, 
    15, 
    17, 
    18, 
    20, 
    21, 
    23, 
    24, 
    26, 
    27, 
    29, 
    30, 
    32, 
    33, 
    35, 
    36, 
    38, 
    39, 
    41, 
    42, 
    44, 
    45, 
    47, 
    48, 
    50, 
    51, 
    53, 
    54, 
    56, 
    57, 
    59, 
    60, 
    62, 
    63, 
    65, 
    66, 
    68, 
    69, 
    71, 
    72, 
    74, 
    75, 
    77, 
    78, 
    80, 
    81, 
    85, 
    86
  ], 
  "heads": [
    [
      88, 
      0, 
      0
    ]
  ], 
  "attrs": {
    "dltype": [
      "list_str", 
      [
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32"
      ]
    ], 
    "device_index": [
      "list_int", 
      [
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1
      ]
    ], 
    "storage_id": [
      "list_int", 
      [
        0, 
        1, 
        2, 
        3, 
        4, 
        5, 
        6, 
        1, 
        7, 
        8, 
        4, 
        9, 
        10, 
        1, 
        11, 
        12, 
        4, 
        13, 
        14, 
        1, 
        15, 
        16, 
        4, 
        17, 
        18, 
        1, 
        19, 
        20, 
        4, 
        21, 
        22, 
        1, 
        23, 
        24, 
        4, 
        25, 
        26, 
        1, 
        27, 
        28, 
        4, 
        29, 
        30, 
        1, 
        31, 
        32, 
        4, 
        33, 
        34, 
        1, 
        35, 
        36, 
        4, 
        37, 
        38, 
        1, 
        39, 
        40, 
        4, 
        41, 
        42, 
        1, 
        43, 
        44, 
        4, 
        45, 
        46, 
        1, 
        47, 
        48, 
        4, 
        49, 
        50, 
        1, 
        51, 
        52, 
        4, 
        53, 
        54, 
        1, 
        55, 
        56, 
        4, 
        57, 
        58, 
        59, 
        60, 
        57, 
        58
      ]
    ], 
    "shape": [
      "list_shape", 
      [
        [1, 3, 224, 224], 
        [1, 1, 224, 224, 3], 
        [8, 1, 3, 3, 3, 4], 
        [1, 8, 1, 1, 4], 
        [1, 8, 112, 112, 4], 
        [8, 1, 3, 3, 1, 4], 
        [1, 8, 1, 1, 4], 
        [1, 8, 112, 112, 4], 
        [16, 8, 1, 1, 4, 4], 
        [1, 16, 1, 1, 4], 
        [1, 16, 112, 112, 4], 
        [16, 1, 3, 3, 1, 4], 
        [1, 16, 1, 1, 4], 
        [1, 16, 56, 56, 4], 
        [32, 16, 1, 1, 4, 4], 
        [1, 32, 1, 1, 4], 
        [1, 32, 56, 56, 4], 
        [32, 1, 3, 3, 1, 4], 
        [1, 32, 1, 1, 4], 
        [1, 32, 56, 56, 4], 
        [32, 32, 1, 1, 4, 4], 
        [1, 32, 1, 1, 4], 
        [1, 32, 56, 56, 4], 
        [32, 1, 3, 3, 1, 4], 
        [1, 32, 1, 1, 4], 
        [1, 32, 28, 28, 4], 
        [64, 32, 1, 1, 4, 4], 
        [1, 64, 1, 1, 4], 
        [1, 64, 28, 28, 4], 
        [64, 1, 3, 3, 1, 4], 
        [1, 64, 1, 1, 4], 
        [1, 64, 28, 28, 4], 
        [64, 64, 1, 1, 4, 4], 
        [1, 64, 1, 1, 4], 
        [1, 64, 28, 28, 4], 
        [64, 1, 3, 3, 1, 4], 
        [1, 64, 1, 1, 4], 
        [1, 64, 14, 14, 4], 
        [128, 64, 1, 1, 4, 4], 
        [1, 128, 1, 1, 4], 
        [1, 128, 14, 14, 4], 
        [128, 1, 3, 3, 1, 4], 
        [1, 128, 1, 1, 4], 
        [1, 128, 14, 14, 4], 
        [128, 128, 1, 1, 4, 4], 
        [1, 128, 1, 1, 4], 
        [1, 128, 14, 14, 4], 
        [128, 1, 3, 3, 1, 4], 
        [1, 128, 1, 1, 4], 
        [1, 128, 14, 14, 4], 
        [128, 128, 1, 1, 4, 4], 
        [1, 128, 1, 1, 4], 
        [1, 128, 14, 14, 4], 
        [128, 1, 3, 3, 1, 4], 
        [1, 128, 1, 1, 4], 
        [1, 128, 14, 14, 4], 
        [128, 128, 1, 1, 4, 4], 
        [1, 128, 1, 1, 4], 
        [1, 128, 14, 14, 4], 
        [128, 1, 3, 3, 1, 4], 
        [1, 128, 1, 1, 4], 
        [1, 128, 14, 14, 4], 
        [128, 128, 1, 1, 4, 4], 
        [1, 128, 1, 1, 4], 
        [1, 128, 14, 14, 4], 
        [128, 1, 3, 3, 1, 4], 
        [1, 128, 1, 1, 4], 
        [1, 128, 14, 14, 4], 
        [128, 128, 1, 1, 4, 4], 
        [1, 128, 1, 1, 4], 
        [1, 128, 14, 14, 4], 
        [128, 1, 3, 3, 1, 4], 
        [1, 128, 1, 1, 4], 
        [1, 128, 7, 7, 4], 
        [256, 128, 1, 1, 4, 4], 
        [1, 256, 1, 1, 4], 
        [1, 256, 7, 7, 4], 
        [256, 1, 3, 3, 1, 4], 
        [1, 256, 1, 1, 4], 
        [1, 256, 7, 7, 4], 
        [256, 256, 1, 1, 4, 4], 
        [1, 256, 1, 1, 4], 
        [1, 256, 7, 7, 4], 
        [1, 256, 1, 1, 4], 
        [1, 1024], 
        [125, 1024, 8], 
        [1, 1000], 
        [1, 1000], 
        [1, 1000]
      ]
    ]
  }, 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    57, 
    58, 
    59, 
    60, 
    61, 
    62, 
    63, 
    64, 
    65, 
    66, 
    67, 
    68, 
    69, 
    70, 
    71, 
    72, 
    73, 
    74, 
    75, 
    76, 
    77, 
    78, 
    79, 
    80, 
    81, 
    82, 
    83, 
    84, 
    85, 
    86, 
    87, 
    88, 
    89
  ]
}